[
  {
    "company": "Sticky Keys Studios",
    "position": "Project Lead, Programmer",
    "date": "Jan. 2022 - May 2022",
    "description": "Led a team of ten people to develop No Screws Attached, a mobile, physics-based competitive multiplayer game using the CUGL and SDL engines, and won most innovative mobile game at the GDIAC 2022 Showcase. Implemented views for game objects, device rotation support, gameplay cameras, menu screens, user preferences, username and networking support, and transitions and animations",
    "img": "../images/NoScrewsAttachedThumb.png",
    "alt": "Thumbnail for the game No Screws Attached where cartoon characters are building and throwing a brick"
  },
  {
    "company": "Cornell University",
    "position": "CS4670 Computer Vision Teacher Assistant",
    "date": "Jan. 2022 - May 2022",
    "description": "Worked closely with Professor Bharath Hariharan to communicate announcements and instructions to students. Helped students who had difficulty with the coursework by explaining key concepts and walking students through algorithms such as Harris corner detector and MOPS.",
    "img": "../images/CornellLogo.png",
    "alt": "Cornell University seal"
  },
  {
    "company": "Cornell Daily Sun",
    "position": "Staff Photographer",
    "date": "Sep. 2019 - May 2022",
    "description": "Captured unique and memorable moments at numerous events across campus as well as candid photos of students.",
    "img": "../images/CornellDailySunLogo.png",
    "alt": "Cornell Daily Sun logo of a capital S written in cursive"
  },
  {
    "company": "Cornell University",
    "position": "CS4620 Computer Graphics Teacher Assistant",
    "date": "Aug. 2021 - Dec. 2021",
    "description": "Worked closely with Professor Abe Davis in the creation and organization of a lesson plan and attended weekly meetings to discuss the course, lesson plan, and assignments. Supported students who were struggling on assignments by explaining key concepts on scene graphs, ray tracing, rasterization, and MVC pattern and connecting topics to current research and industry technologies.",
    "img": "../images/CornellLogo.png",
    "alt": "Cornell University seal"
  },
  {
    "company": "Studio Baguette",
    "position": "Project Lead, Programmer",
    "date": "Feb. 2021 - May 2021",
    "description": "Led a team of eight people to develop Change in Charge, a physics-based, puzzle platform game using the LibGDX engine, and demoed at the GDIAC 2021 Showcase. Designed the game architecture specification and implemented intricate magnetism physics, major model interactions, a level select screen, a pause menu, and user preferences logic and menu.",
    "img": "../images/ChangeInChargeThumb.png",
    "alt": "Thumbnail for the game Change in Charge where two cartoon robots are standing next to each other on a metal platform"
  }
]